trade_exp/src/Documents/КорректировкаДоставокВИнтервалах/КорректировкаДоставокВИнтервалах.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension" extendedConfigurationObject="95f8db74-0749-436c-b1a9-ec710e5cc6af">
  <name>КорректировкаДоставокВИнтервалах</name>
  <objectBelonging>Adopted</objectBelonging>
  <attributes extendedConfigurationObject="66a9d133-e39a-4d3e-a0bb-24b48fb05c57">
    <name>Интервал</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="b080db5e-4ea9-4254-8a06-cf8e0ce480f6">
    <name>КоличествоДоставок</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>3</precision>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="d5a09345-75b8-4668-906c-be160e992a18">
    <name>Автор</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="ad915c98-729e-46a2-931b-e9b70cd0c405">
    <name>ДатаДействия</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="5f617744-b918-4938-8cc3-15782276b89b">
    <name>ДляРазгрузки</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
</mdclass:Document>

trade_exp/src/Documents/КорректировкаДоставокВИнтервалах/ObjectModule.bsl
&Перед("ПередЗаписью")
Процедура Док_ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)  
	
	Если РежимЗаписи = РежимЗаписиДокумента.Проведение И  Не Ссылка.Проведен	Тогда
		Запрос = Новый Запрос;
		Запрос.Текст =
		"ВЫБРАТЬ
		|	ИспользованиеИнтерваловДоставки.Регистратор КАК Регистратор
		|ИЗ
		|	РегистрНакопления.ИспользованиеИнтерваловДоставки КАК ИспользованиеИнтерваловДоставки
		|ГДЕ 
		|    ИспользованиеИнтерваловДоставки.Интервал = &Интервал	
		|	И ИспользованиеИнтерваловДоставки.ДатаИспользования МЕЖДУ НАЧАЛОПЕРИОДА(&ДатаИспользования, ДЕНЬ) И КОНЕЦПЕРИОДА(&ДатаИспользования, ДЕНЬ)
		|	И ИспользованиеИнтерваловДоставки.Регистратор ССЫЛКА Документ.КорректировкаДоставокВИнтервалах
		|	И ИспользованиеИнтерваловДоставки.ДляРазгрузки = &ДляРазгрузки";
		Запрос.УстановитьПараметр("Интервал", Интервал);
		Запрос.УстановитьПараметр("ДатаИспользования",ДатаДействия);
		Запрос.УстановитьПараметр("ДляРазгрузки", ДляРазгрузки);
		Выборка = Запрос.Выполнить().Выбрать(); 
		Если Выборка.Следующий()Тогда   
			Отказ = Истина;                           
			ОбщегоНазначения.СообщитьПользователю("По данному инервалу на дату действия " + ДатаДействия + " уже создан документ " + Выборка.Регистратор,Выборка.Регистратор);
		КонецЕсли;
	КонецЕсли;

КонецПроцедуры

&Вместо("ОбработкаПроведения")
Процедура Док_ОбработкаПроведения(Отказ, РежимПроведения)
		
		Движения.ИспользованиеИнтерваловДоставки.Записывать = Истина;
		Движение = Движения.ИспользованиеИнтерваловДоставки.Добавить(); 
		
		Движение.Период = ТекущаяДата();
	    Движение.ДатаИспользования = ДатаДействия;
		Движение.Интервал = Интервал;	
		Движение.ВидДоставки = Интервал.ВидДоставки;
		Движение.Подразделение = Интервал.Подразделение;
		
	  //Если ДляРазгрузки  Тогда 
	  //  	Движение.КоличествоСРазгрузкой = Интервал.МксКолДоставокСРазгрузкой - КоличествоДоставок; 
	  //  Иначе
	  //  	Движение.Количество = Интервал.КоличествоДоставок - КоличествоДоставок;
	  //  КонецЕсли;		
			
		Если ДляРазгрузки  Тогда 
			Движение.КоличествоСРазгрузкой = КоличествоДоставок; 
			Движение.ДляРазгрузки = Истина;
		Иначе
			Движение.Количество = КоличествоДоставок; 
		    Движение.ДляРазгрузки = Ложь;
		КонецЕсли;
			
	
КонецПроцедуры
